exports.menu = (ucapan, ownerName, botName, prefix, pendaftar, runtime, pushname, isOwner, isPremium, sisalimit, limitCount, glimit, gcount, expired, tanggal, jam) => {
    return `╭─̋✦─̫✧─̋𖧵─̫𖧷─̋✦─̫✧─̋𖧵─̫𖧷
│˚  ·.  ·✵  L  O  A  D  I  N  G·  •.   ✶   +
│◤◢◤◢◤◢◤◢ 25%
│꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́
│ ◤◢◤◢◤◢◤◢◤◢ 5O%
│꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́
│ ◤◢◤◢◤◢◤◢◤◢◤◢ 75%
│꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷́꒦꒷꒦
│ ◤◢◤◢◤◢◤◢◤◢◤◢◤◢1OO%
│˚  ·.  ·✵  ＣＯＭＰＬＥＴＥ·  •.   ✶   +

╰─̋✦─̫✧─̋𖧵─̫𖧷─̋✦─̫✧─̋𖧵─̫𖧷

» [ += AUTHOR BY RAHMANGANZ += ] «

⠀0:00 ─〇───── 0:00

⠀  ⇄   ◃◃   ⅠⅠ   ▹▹   ↻

ılı.lıllılı.ıllı.

${ucapan.data.result} ${pushname}
╭┈─────── ೄྀ࿐ ˊˎ- 
╰┈➤ ❝ [ ${botName} ] ❞
╭ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ╮
┊ ꦿ⌗*Creator : ${ownerName}*
┊ ꦿ⌗*Lib : Baileys V.3.5.1*
┊ ꦿ⌗*Prefix : 「 ${prefix} 」*
┊ ꦿ⌗*Total Fitur : 450+*
┊ ꦿ⌗*Total Pengguna : ${pendaftar.length}*
┊ ꦿ⌗*Tanggal : ${tanggal}*
┊ ꦿ⌗*Pukul : ${jam}*
┊ ꦿ⌗*Runtime Bot*
┊ ꦿ⌗*${runtime}*
╰ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ╯
╭┈─────── ೄྀ࿐ ˊˎ- 
╰┈➤ ❝ [ USER INFO ] ❞
╭ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ╮
├≽ *Name* : *${pushname}*
├≽ *Status* : *${isOwner ? 'OWNER' : isPremium ? 'Premium' : 'Gratisan'}*
├≽ *Limit* : *${isPremium ? 'Unlimited' : `${sisalimit}/${limitCount}`}*
├≽ *Limit Game* : *${isOwner ? 'Unlimited' : `${glimit}/${gcount}`}*
├≽ *Expired Prem : ${isOwner ? '-' : isPremium ? expired : 'Not Premium'}*
╰ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ┈ ╯

╭┈─────── ೄྀ࿐ ˊˎ- 
╰┈➤ ❝ [ *MENU ABOUT* ] ❞
⚖️:ཻུ۪۪ ⌗ ➩ *${prefix}newmenu*
⚖️:ཻུ۪۪ ⌗ ➩ *${prefix}runtime*
⚖️:ཻུ۪۪ ⌗ ➩ *${prefix}stats*

╭──═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜͡❝──────────═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜ 
	
╭┈─────── ೄྀ࿐ ˊˎ- 
╰┈➤ ❝ [ *MENU BOT* ] ❞
•◦ •≫ *${prefix}sticker*
•◦ •≫ *${prefix}swm*
•◦ •≫ *${prefix}take*
•◦ •≫ *${prefix}toimg*
•◦ •≫ *${prefix}attp [text]*
•◦ •≫ *${prefix}nuliskiri*
•◦ •≫ *${prefix}tinyurl*
•◦ •≫ *${prefix}nuliskanan*
•◦ •≫ *${prefix}foliokiri*
•◦ •≫ *${prefix}foliokanan*
•◦ •≫ *${prefix}translate*

╭──═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜͡❝──────────═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜ 
	╰──➩➩➩➩➩➩➩➩➩➩➩
╭┈─────── ೄྀ࿐ ˊˎ- 
╰┈➤ ❝ [ *DOWNLOADER PREMIUM* ] ❞
•◦ •≫ *${prefix}ytmp4*
•◦ •≫ *${prefix}ytmp3*
•◦ •≫ *${prefix}igdl*
•◦ •≫ *${prefix}fbdl*
•◦ •≫ *${prefix}tiktok*
•◦ •≫ *${prefix}tomp3*
•◦ •≫ *${prefix}play*
•◦ •≫ *${prefix}yts*
•◦ •≫ *${prefix}playmp4*

╭──═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜͡❝──────────═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜ 
	╰──➩➩➩➩➩➩➩➩➩➩➩
	
╭┈─────── ೄྀ࿐ ˊˎ- 
╰┈➤ ❝ [ *MENU STALKER* ] ❞
•◦ •≫ *${prefix}igstalk*
•◦ •≫ *${prefix}ghstalk*

╭──═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜͡❝──────────═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜ 
	╰──➩➩➩➩➩➩➩➩➩➩➩
	
╭┈─────── ೄྀ࿐ ˊˎ- 
╰┈➤ ❝ [ *MENU MAKER* ] ❞
•◦ •≫ *${prefix}blackpink*
•◦ •≫ *${prefix}tahta*
•◦ •≫ *${prefix}neon*
•◦ •≫ *${prefix}glitch*
•◦ •≫ *${prefix}thundername*
•◦ •≫ *${prefix}pornhub*

╭──═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜͡❝──────────═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜ 
	╰──➩➩➩➩➩➩➩➩➩➩➩
	
╭┈─────── ೄྀ࿐ ˊˎ- 
╰┈➤ ❝ [ *MENU BAILEYS* ] ❞
•◦ •≫ *${prefix}tagme*
•◦ •≫ *${prefix}kontak*
•◦ •≫ *${prefix}hidetag*
•◦ •≫ *${prefix}jadian*
•◦ •≫ *${prefix}ganteng*
•◦ •≫ *${prefix}cantik*

╭──═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜͡❝──────────═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜ 
	╰──➩➩➩➩➩➩➩➩➩➩➩
	
╭┈─────── ೄྀ࿐ ˊˎ- 
╰┈➤ ❝ [ *MENU GAME* ] ❞
•◦ •≫ *${prefix}topbalance*
•◦ •≫ *${prefix}buylimit*
•◦ •≫ *${prefix}tictactoe*
•◦ •≫ *${prefix}tebakgambar*
•◦ •≫ *${prefix}family100*

╭──═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜͡❝──────────═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜ 
	╰──➩➩➩➩➩➩➩➩➩➩➩
	
╭┈─────── ೄྀ࿐ ˊˎ- 
╰┈➤ ❝ [ *MENU WIBU* ] ❞
┠─≽ *${prefix}waifu*
┠─≽ *${prefix}loli*
┠─≽ *${prefix}nekonime*
┠─≽ *${prefix}megumin*
┠─≽ *${prefix}sagiri*
┠─≽ *${prefix}shinobu*

╭──═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜͡❝──────────═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜ 
	╰──➩➩➩➩➩➩➩➩➩➩➩
	
╭┈─────── ೄྀ࿐ ˊˎ- 
╰┈➤ ❝ [ *MENU RANDOM* ] ❞
┠─≽ *${prefix}apakah*
┠─≽ *${prefix}bisakah*
┠─≽ *${prefix}kapankah*
┠─≽ *${prefix}hobby*
┠─≽ *${prefix}rate*
┠─≽ *${prefix}cekbapak*
┠─≽ *${prefix}seberapagay*
┠─≽ *${prefix}truth*
┠─≽ *${prefix}dare*

╭──═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜͡❝──────────═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜ 
	╰──➩➩➩➩➩➩➩➩➩➩➩
	
╭┈─────── ೄྀ࿐ ˊˎ- 
╰┈➤ ❝ [ *MENU GROUP* ] ❞
┠─≽ *${prefix}afk*
┠─≽ *${prefix}infogrup*
┠─≽ *${prefix}chatinfo*
┠─≽ *${prefix}add*
┠─≽ *${prefix}kick*
┠─≽ *${prefix}kicktime*
┠─≽ *${prefix}promote*
┠─≽ *${prefix}intro*
┠─≽ *${prefix}demote*
┠─≽ *${prefix}linkgc*
┠─≽ *${prefix}revoke*
┠─≽ *${prefix}leave*
┠─≽ *${prefix}setdesc*
┠─≽ *${prefix}setgrupname*
┠─≽ *${prefix}setppgrup*
┠─≽ *${prefix}opengrup*
┠─≽ *${prefix}closegrup*
┠─≽ *${prefix}tagall*
┠─≽ *${prefix}mute*
┠─≽ *${prefix}unmute*
┠─≽ *${prefix}antilink*
┠─≽ *${prefix}antiwame*
┠─≽ *${prefix}antilinkig*
┠─≽ *${prefix}antibadword*
┠─≽ *${prefix}autosticker*
┠─≽ *${prefix}listbadword*
┠─≽ *${prefix}welcome*
┠─≽ *${prefix}left*

╭──═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜͡❝──────────═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜ 
	╰──➩➩➩➩➩➩➩➩➩➩➩
	
╭┈─────── ೄྀ࿐ ˊˎ- 
╰┈➤ ❝ [ *MENU OWNER* ] ❞
•◦ •≫ >
•◦ •≫ $
•◦ •≫ *${prefix}join*
•◦ •≫ *${prefix}self*
•◦ •≫ *${prefix}bugtroli*
•◦ •≫ *${prefix}public*
•◦ •≫ *${prefix}setpp*
•◦ •≫ *${prefix}setname*
•◦ •≫ *${prefix}setbio*
•◦ •≫ *${prefix}setprefix*
•◦ •≫ *${prefix}bc*
•◦ •≫ *${prefix}clearall*
•◦ •≫ *${prefix}exif*
•◦ •≫ *${prefix}setthumb*
•◦ •≫ *${prefix}addprem*
•◦ •≫ *${prefix}delprem*
•◦ •≫ *${prefix}cekprem*
•◦ •≫ *${prefix}listprem*
•◦ •≫ *${prefix}ban*
•◦ •≫ *${prefix}unban*
•◦ •≫ *${prefix}listban*

╭──═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜͡❝──────────═️ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ҈ۣٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜۜ͜͡♕͜ 
	╰──➩➩➩➩➩➩➩➩➩➩➩

╭────≽「 *SUPPORT ${botName}* 」
┴

│➲ *Aulia Rahman*
│➲ *Irvan Store*
│➲ *Y- DhyZx*
│➲ *Aqulz*
│➲ *Mr.Ellen*
│➲ *Ramlan Id*
│➲ *Mhankbarbar*
│➲ *Hafiz*
│➲ *Skimura Bot*
│➲ *Zam-Bot*
│➲ *Xinz-Team*
┬
╰──────≽ *「 ${botName} 」*`
}


exports.newMenu = (ucapan, ownerName, botName, prefix, pendaftar, runtime, pushname, isOwner, isPremium, sisalimit, limitCount, glimit, gcount, expired, tanggal, jam) => {
    return `${ucapan.data.result} ${pushname}
╞═══ 《 *USER INFO* 》 ═══
├────────────────────
├≽ *Name* : *${pushname}*
├≽ *Status* : *${isOwner ? 'OWNER' : isPremium ? 'Premium' : 'Gratisan'}*
├≽ *Limit* : *${isPremium ? 'Unlimited' : `${sisalimit}/${limitCount}`}*
├≽ *Limit Game* : *${isOwner ? 'Unlimited' : `${glimit}/${gcount}`}*
├≽ *Expired Prem : ${isOwner ? '-' : isPremium ? expired : 'Not Premium'}*
├────────────────────
├> *Jam* : ${jam}
├> *Tanggal* : ${tanggal}
├────────────────────
╞════ 《 *UPDATE AUTO RESPONDER* 》 ════
├────────────────────
├ INI GA PAKAI PREFIX!! INGAT ITU
┠─≽ *spamcall*
┠─≽ *spamsms*
┠─≽ *scriptterkey*
┠─≽ *scriptdeface*
┠─≽ *installtermuxubuntu*
┠─≽ *scriptspammers*
┠─≽ *scriptwifihacker*
┠─≽ *scriptsqlmap*
┠─≽ *scriptandroidmalware*
┠─≽ *scriptminitools*
┠─≽ *scriptvtools*
┠─≽ *githubme*
╞════ 《 *UPDATE MENU MAKER!* 》 ════
┠─≽ *${prefix}suit*
┠─≽ *${prefix}pinterest*
┠─≽ *${prefix}matrix*
┠─≽ *${prefix}halloween*
┠─≽ *${prefix}devilwings*
┠─≽ *${prefix}cloudtext*
┠─≽ *${prefix}bloodtext*
┠─≽ *${prefix}bloodtext2*
┠─≽ *${prefix}steeltext*
┠─≽ *${prefix}lavatext*
┠─≽ *${prefix}toxiclogo*
┠─≽ *${prefix}dropwater*
┠─≽ *${prefix}sandwrite*
┠─≽ *${prefix}3dwater*
┠─≽ *${prefix}graffiti*
┠─≽ *${prefix}graffiti2*
┠─≽ *${prefix}phlogo*
┠─≽ *${prefix}graffiti3*
┠─≽ *${prefix}layeredtext*
┠─≽ *${prefix}vintage*
┠─≽ *${prefix}3dspace*
┠─≽ *${prefix}stonetext*
┠─≽ *${prefix}avengers*
┠─≽ *${prefix}marvellogo*
┠─≽ *${prefix}3dmetal*
┠─≽ *${prefix}lionlogo*
┠─≽ *${prefix}wolflogo*
┠─≽ *${prefix}ninjalogo*
┠─≽ *${prefix}pubglogo*
┠─≽ *${prefix}shadowtext*
┠─≽ *${prefix}smoketext*
┠─≽ *${prefix}romancetext*
┠─≽ *${prefix}carvedwood*
┠─≽ *${prefix}harrypotter*
┠─≽ *${prefix}flamingtext*
┠─≽ *${prefix}falleaves*
┠─≽ *${prefix}underwater*
┠─≽ *${prefix}wolfmetal*
┠─≽ *${prefix}woodboard*
┠─≽ *${prefix}undergrass*
┠─≽ *${prefix}coffetext*
┠─≽ *${prefix}lovetext*
┠─≽ *${prefix}burnpaper*
┠─≽ *${prefix}lovemessage*
┠─≽ *${prefix}cekapikey*
┬
╰─────────────────────

╞════ 《 *THANKS TOO ${botName}* 》 ════
-> Aulia Rahman
-> Mr.Tyo
-> Nurutomo
-> Irvan Store
-> Mr.Ellen
-> Azzam Ganz
-> Ramlan Id
-> Aqulz
-> Xinz-Team
┬
╰─────────────────────`
}
